#-----------------задача-------------------#


'''Напишите программу, которая принимает три числа
от пользователя и определяет, какое из них максимальное.
нельзя использовать max
'''

'''number1 = float(input("Введите число: "))
number2 = float(input("Введите число: "))
number3 = float(input("Введите число: "))

if number1 > number2 and number1 > number3:
    print(number1)
elif number2 > number1 and number2 > number3:
    print(number2)
elif number3 > number1 and number3 > number2:
    print(number3)

'''

