#------------------на что обратить внимание в дз#
# наименование переменных наименование файлов #
'''
C = 5
F = 6
'''
import time

'''
Пользователь вводит сумму вклада в банк и годовой процент 
найдите ссуму вклада серез 5 лет



сумма вклада = 1000
годовой процент = 10


1000 * ( 1 + 10 / 100 )  * 1.1 .... и так 5 раз

'''

#------------------Условные операторы-----------#
'''
if условия:
    действие 
else:
    действие 
'''

#-----------------модуль turtle----------------#
# модуль  turtle-  преднозначен для создания графических элементов
import turtle



# turtle.forward(100) # нарисовать линию
# turtle.left(60) # повернуть на 60 градусов

# time.sleep(5) #заморозка работы

# answer_father = input( 'Пойдет ли петя в кино?/n')
# if answer_father == 'да':
#     print('петя идет в кино ура')
# else:
#     print('петя  не идет в кино ')

# grade = int(input('Оценка студента'))
# if grade >= 90:
#     print('отлично')
# elif (grade > 71 and grade < 89):
#     print('Хорошо')
# elif (grade > 61 and grade < 70):
#     print('Удовлетворительно')
# else:
#     print('пересдача')



#----------------------------------- Задача –--------------------------------#
'''
Пользователь вводит сумму покупки. 
Если стоимость покупки больше 5000, то скидка составит 15%.
Если стоимость больше 3000, то скидка составит 10%
'''