"""
Задача: У вас есть два набора клиентов: один, который купил продукт A, и другой, который купил продукт B. Найдите клиентов, которые купили оба продукта.
Пример:
Множество клиентов, купивших продукт A: {1001, 1002, 1003, 1004}
Множество клиентов, купивших продукт B: {1003, 1004, 1005, 1006}
Результат: {1003, 1004}
"""

# set_A ={1001, 1002, 1003, 1004}
# set_B ={1003, 1004, 1005, 1006}
# resul = set_A & set_B
# print(resul)


# ------------------------------------- Задача ------------------------------------------------#
'''
   - **Условие**: У каждого пирата есть карта, 
   которая представлена в виде словаря, где ключ — это остров,
    а значение — это количество зарытых сокровищ на этом острове. 
    Необходимо написать программу, которая найдёт остров с
     максимальным количеством сокровищ.
   - **Данные для примера**: `{"Остров Сокровищ":
    5, "Необитаемый остров": 3, "Остров Снов": 7}`
'''
