'''
n школьников делят k яблок поровну,
неделяющийся остаток остается в корзинке.
Сколько яблок останется в корзинке?
'''
# n = int(input('школьников:'))
# k = int(input('Яблок:'))
# print(k % n)


'''
Программа принимает на себя вещественное число -
 грамм конфет. Программа должна рассчитывать Сколько денег потребуется 
для оплаты такого кол-ва грамм, если кило этих конфет стоит 1340Р
'''
# x = float(input('грамм:'))
# print(x * (1340 / 1000))

'''

две переменные - 
ввести длину и ширину. Вывести в консоль (периметр =длина + ширина)*2 и 
(площадь=длина * ширина)
 
'''
# x = int(input('напишите значение:'))
# y = int(input('напишите значение:'))
# res = (x * 2) + (y *2)
# res2 = x *y
# print( {res})
# print( {res2})

'''
Дано два числа a и b. 
Выведите гипотенузу треугольника с заданными катетами.
'''
# a = float(input('Введите значение катета a: '))
# b = float(input('Введите значение катета b: '))
# c = (a**2 + b**2)**0.5
# print('Гипотенуза равна', c)


'''
Вы планируете долгую поездку на автомобиле и хотите знать, сколько вам придется потратить на бензин. 
Напишите программу, которая запрашивает у вас количество километров, которое вы планируете проехать, 
и средний расход топлива вашего автомобиля
 (в литрах на 100 км). После этого программа должна вычислить и вывести предполагаемую стоимость бензина для вашего путешествия.
'''

# s = int(input('Ввведите расстояние'))
# v = int(input('Укажите средний расход топлива на 100 км'))
# d = v / 100 * 50 * s# расход на 1 км
# print(f'Цена за данное расстояние равна {d} рублей')



# a = int(input('Введите  число'))
# if a % 2 == 0:
#     print('Число четное')
# else:
#     print('Число нечетное')


# numbers = int (input('Введите ваш возраст'))
# if numbers >= 0 and numbers <= 6:
#     print ('Ты ребенок')
# if numbers >= 7 and numbers <= 11:
#     print ('отрок')
# if numbers >= 12 and numbers <= 17:
#     print ('подрострок')
# if numbers >= 18 and numbers <= 35:
#     print ('зрелый')
# if numbers >= 36 and numbers <= 50:
#     print ('взрослый')
# if numbers >= 51 and numbers <= 100:
#     print ('помянем')

# b = int(input('Введите номер месяца рождения'))
# if b >= 3 and b <= 5:
#     print('Вы родились весной.Птицы пели прекрасные песни ')
# elif b >= 6 and b <= 8:
#     print('Вы родились летом.Солнце светило ярче чем когда-либо ')
# elif b >= 9 and b <= 11:
#     print('Вы родились осенью.Урожай был невероятным. ')
#
# elif b == 12:
#     print('Вы родились зимой.За окном падал белый снег,. ')
# else:
#     print('Такого месяца не существует')
